test/stress-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 100
      name: 'Ramp up traffic'
    - duration: 30
      arrivalRate: 100
      name: 'Sustained load'
  processor: "./processor.js"
scenarios:
  - flow:
      - function: "generateRandomData"
      - post:
          url: '/nominees'
          json:
            title: "{{ title }}"
            description: "{{ description }}"
            release: "{{ release }}"
            director: "{{ director }}"
            winner: "{{ winner }}"
      - get:
          url: '/nominees?sortBy=title&sortOrder=asc&page=1&limit=10'